# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)


 Category.create ([{name: 'Купить и доставить', ancestry: '1'}, {name: 'Срочная доставка', ancestry: '1'}, {name: 'Доставка продуктов', ancestry: '1'}, {name:'Доставка еды из ресторана', ancestry: '1'}, {name: 'Другая посылка', ancestry: '1'}, {name:'Курьер на день', ancestry: '1'},


{name:'Сантехнические работы'}, {name: 'Электромонтажные работы'}, {name:'Отделочные работы'}, {name: 'Потолки'}, {name: 'Полы'}, {name: 'Плиточные работы'}, {name: 'Сборка и ремонт мебели'}, {name: 'Установка и ремонт дверей, замков'} ,{name:'Остекление окон и балконов'}, {name:'Кровельные и фасадные работы'} , {name:'Отопление, водоснабжение, канализация'}, {name:'Изоляционные трубы' }, {name:'Строительно -монтажные работы'} , {name:'Крупное строительство' }, {name:'Охранные системы'},

 {name:'Грузоперевозки'},{name:'Перевозка вещей, переезды'} ,{name:'Пассажирские перевозки'} ,{name:'Строительные грузы и оборудование'} ,{name:'Вывоз мусора'} ,{name:'Эвакуаторы'} ,{name:'Междугородные перевозки'} ,{name:'Услуги грузчиков'} ,{name:'Перевозка продуктов'} ,{name:'Другой груз'} ,


 {name:'Уборка и помощь по хозяйству'} ,{name:'Поддерживающая уборка'} ,{name:'Генеральная уборка'} ,{name:'Мытье окон'} ,{name:'Вынос мусора'} ,{name:'Помощь швеи'} ,{name:'Приготовление еды'} ,{name:'Глажение белья'} ,{name:'Химчистка'} ,{name:'Уход за животными'} ,{name:'Работа в саду'} ,{name:'Сиделки'} ,{name:'Няни'} ,


 {name:'Виртуальный помощник'} ,{name:'Работа с текстом, копирайтинг, переводы'} ,{name:'Поиск и обработка информации'} ,{name:'Работа в Exel, Power Point и т.д.'} ,{name:'Расшифровка аудио-видеозаписей'} ,{name:'Размещение объявлений'} ,{name:'Реклама и продвижение в интернете'} ,{name:'Обзвон по базе'} , 
                   
                   
 {name:'Компьютерная помощь'} ,{name:'Ремонт компьютеров и ноутбуков'} ,{name:'Установка ПО и ОС'} ,{name:'Удаление вирусов'} ,{name:'Настройка интернета'} ,{name:'Замена комплектующих'} ,{name:'Восстановление данных'} ,{name:'Консультация и обучение'},
                   
                   
 {name:'Web-Разработка'}, {name: 'Сайт под ключ'}, {name: 'Доработка и поддержка сайта'}, {name: 'Программирование и разработка ПО'}, {name: 'Верстка'}, {name: 'Разработка мобильных приложений'},
                   
                   {name: 'Дизайн'}, {name: 'Фирменный стиль'}, {name: 'Логотипы и визитки'}, {name: 'Иллюстрации, живопись, граффити'}, {name: 'Дизайн сайтов и приложений'}, {name: 'Интернет-баннеры, оформление соц. сетей'}, {name: '3D-графика, анимация'}, {name: 'Презентации, иконки'}, {name: 'Наружная реклама, стенды'}, {name: 'Архитектура, интерьер, ландшафт'},
                   
                   {name: 'Мероприятия'}, {name: 'Помощь в проведении мероприятий'}, {name: 'Ведущий, аниматор'}, {name: 'Промоутер'}, {name: 'Музыканты, певцы, танцоры'},
                   
                   {name: 'Фото и видео услуги'}, {name: 'Фотосъемка'}, {name: 'Видеосъемка'}, {name: 'Ретушь фото'}, {name: 'Монтаж и цветокорекция видео'}, {name: 'Оцифровка'},
                   
                   
                   {name: 'Установка и ремонт техники'}, {name: 'Холодильники и морозильные камеры'}, {name: 'Стиральные и сушильные машины'}, {name: 'Посудомоечные машины'}, {name: 'Электрические плиты и панели'}, {name: 'Газовые плиты, вытяжки, духовки'}, {name: 'Водонагреватели, бойлеры, колонки, котлы'}, {name: 'Пылесосы и очистители'}, {name: 'Мелкая техника'}, 
                   
                   
                   
                   {name: 'Красота и здоровье'}, {name: 'Парикмахерские услуги'}, {name: 'Ногтевой сервис'}, {name: 'Массаж'}, {name: 'Косметология, макияж'}, {name: 'Стилисты'}, {name: 'Персональный тренер'}, 
                   
                   
                   {name: 'Ремонт цифровой техники'}, {name: 'Планшеты и телефоны'}, {name: 'Аудиотехника и системы'}, {name: 'Телевизоры и мониторы'}, {name: 'Автомобильная электроника'}, {name: 'Игровые приставки'}, {name: 'Спутниковые антенны'}, {name: 'Часы'}, 
                   
                   
                   
                   
                   {name: 'Юридическая помощь'}, {name: 'Юридическая консультация'}, {name: 'Составление и проверка договоров, жалоб, исков'}, {name: 'Оформление документов'}, {name: 'Регистрация, ликвидация компаний'}, 
                   
                   
                   
                   
                   {name: 'Образование'}, {name: 'Иностранные языки'}, {name: 'Подготовка к школе'}, {name: 'Начальная школа'}, {name: 'Средняя школа, выпускные классы'}, {name: 'Подготовка к ЕГЭ'}, {name: 'Логопеды'}, {name: 'Музыка'}, {name: 'Спорт'}, {name: 'Красота и уход за собой'}, {name: 'Рукоделие и хобби'}, 
                   
                   
                   {name: 'Ремонт транспорта'}, {name: 'Техническое обслуживание'}, {name: 'Кузовной ремонт'}, {name: 'Автоэлектрика'}, {name: 'Шиномонтаж'}, {name: 'Мойка и чистка' }, {name: 'Тюнинг'}, {name: 'Мотосервис'}])
